home buh/src/Documents/ПланПокупок/ПланПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПокупок</name>
  <registerRecords>AccumulationRegister.ПотребностьВПродуктах</registerRecords>
  <attributes>
    <name>СуммаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкаПродуктов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

home buh/src/Documents/ПланПокупок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПотребностьВпродуктах Приход
	Движения.ПотребностьВпродуктах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ПотребностьВпродуктах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
		Движение.Количество = ТекСтрокаПокупкаПродуктов.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ПокупкаПродуктов("Итого") = ПокупкаПродуктов("Количество") * ПокупкаПродуктов("Цена");
	
	СуммаОбщая = ПокупкаПродуктов.Итог("Итого");
	
КонецПроцедуры
